# About Dataset :-

This problem statement determines, how student marks get affected based on several features like, gender, Ethnicity, Parental level education, Lunch and test preparation course.

In [19]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings("ignore")

In [20]:
df = pd.read_csv('studPerf.csv')
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [21]:
df.isna().sum()

gender                         0
race/ethnicity                 0
parental level of education    0
lunch                          0
test preparation course        0
math score                     0
reading score                  0
writing score                  0
dtype: int64

In [22]:
# Gender distribution
print(df['gender'].value_counts())
print(df['gender'].unique())

gender
female    518
male      482
Name: count, dtype: int64
['female' 'male']

In [23]:
# parental level of education
print(df['parental level of education'].value_counts())
print(df['parental level of education'].unique())

parental level of education
some college          226
associate's degree    222
high school           196
some high school      179
bachelor's degree     118
master's degree        59
Name: count, dtype: int64
["bachelor's degree" 'some college' "master's degree" "associate's degree"
 'high school' 'some high school']

In [24]:
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [25]:
categorical_features = [features for features in df.columns if df[features].dtype == 'O']
numerical_features = [features for features in df.columns if df[features].dtype != 'O']
print("Categorical Features:", categorical_features)
print("Numerical Features:", numerical_features)

Categorical Features: ['gender', 'race/ethnicity', 'parental level of education', 'lunch', 'test preparation course']
Numerical Features: ['math score', 'reading score', 'writing score']

In [26]:
df['total score'] = df['math score'] + df['reading score'] + df['writing score']
df['average score'] = df['total score'] / 3

In [27]:
df = df.drop(columns=['math score', 'reading score', 'writing score'], axis=1)

In [28]:
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,total score,average score
0,female,group B,bachelor's degree,standard,none,218,72.666667
1,female,group C,some college,standard,completed,247,82.333333
2,female,group B,master's degree,standard,none,278,92.666667
3,male,group A,associate's degree,free/reduced,none,148,49.333333
4,male,group C,some college,standard,none,229,76.333333

In [30]:
print(df['race/ethnicity'].value_counts())
print(df['race/ethnicity'].unique())

race/ethnicity
group C    319
group D    262
group B    190
group E    140
group A     89
Name: count, dtype: int64
['group B' 'group C' 'group A' 'group D' 'group E']

In [31]:
print(df['lunch'].value_counts())
print(df['lunch'].unique())

lunch
standard        645
free/reduced    355
Name: count, dtype: int64
['standard' 'free/reduced']

In [32]:
print(df['test preparation course'].value_counts())
print(df['test preparation course'].unique())

test preparation course
none         642
completed    358
Name: count, dtype: int64
['none' 'completed']

In [33]:
df = df.drop(columns=['lunch'], axis=1)

In [34]:
df.head()

,gender,race/ethnicity,parental level of education,test preparation course,total score,average score
0,female,group B,bachelor's degree,none,218,72.666667
1,female,group C,some college,completed,247,82.333333
2,female,group B,master's degree,none,278,92.666667
3,male,group A,associate's degree,none,148,49.333333
4,male,group C,some college,none,229,76.333333